# IdeaStatiCa.ConnectionApi.Model.ConFastenerPosition

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**X** | **double** |  | [optional]
**Y** | **double** |  | [optional]
**GridIndex** | **int** |  | [optional]
**SlottedHoles** | **List&lt;ConSlottedHole&gt;** |  | [optional]
**HookRotation** | **double?** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)